CSI API ETABS v1
cAutoSeismic.GetIBC2006 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetIBC2006(
	string Name,
	ref int DirFlag,
	ref double Eccen,
	ref int PeriodFlag,
	ref int CtType,
	ref double UserT,
	ref bool UserZ,
	ref double TopZ,
	ref double BottomZ,
	ref double R,
	ref double Omega,
	ref double Cd,
	ref double I,
	ref int IBC2006Option,
	ref double Latitude,
	ref double Longitude,
	ref string ZipCode,
	ref double Ss,
	ref double S1,
	ref double Tl,
	ref int SiteClass,
	ref double Fa,
	ref double Fv
)
Function GetIBC2006 (
	Name As String,
	ByRef DirFlag As Integer,
	ByRef Eccen As Double,
	ByRef PeriodFlag As Integer,
	ByRef CtType As Integer,
	ByRef UserT As Double,
	ByRef UserZ As Boolean,
	ByRef TopZ As Double,
	ByRef BottomZ As Double,
	ByRef R As Double,
	ByRef Omega As Double,
	ByRef Cd As Double,
	ByRef I As Double,
	ByRef IBC2006Option As Integer,
	ByRef Latitude As Double,
	ByRef Longitude As Double,
	ByRef ZipCode As String,
	ByRef Ss As Double,
	ByRef S1 As Double,
	ByRef Tl As Double,
	ByRef SiteClass As Integer,
	ByRef Fa As Double,
	ByRef Fv As Double
) As Integer
Dim instance As cAutoSeismic
Dim Name As String
Dim DirFlag As Integer
Dim Eccen As Double
Dim PeriodFlag As Integer
Dim CtType As Integer
Dim UserT As Double
Dim UserZ As Boolean
Dim TopZ As Double
Dim BottomZ As Double
Dim R As Double
Dim Omega As Double
Dim Cd As Double
Dim I As Double
Dim IBC2006Option As Integer
Dim Latitude As Double
Dim Longitude As Double
Dim ZipCode As String
Dim Ss As Double
Dim S1 As Double
Dim Tl As Double
Dim SiteClass As Integer
Dim Fa As Double
Dim Fv As Double
Dim returnValue As Integer
returnValue = instance.GetIBC2006(Name,
	DirFlag, Eccen, PeriodFlag, CtType,
	UserT, UserZ, TopZ, BottomZ, R, Omega,
	Cd, I, IBC2006Option, Latitude, Longitude,
	ZipCode, Ss, S1, Tl, SiteClass, Fa,
	Fv)
int GetIBC2006(
	String^ Name,
	int% DirFlag,
	double% Eccen,
	int% PeriodFlag,
	int% CtType,
	double% UserT,
	bool% UserZ,
	double% TopZ,
	double% BottomZ,
	double% R,
	double% Omega,
	double% Cd,
	double% I,
	int% IBC2006Option,
	double% Latitude,
	double% Longitude,
	String^% ZipCode,
	double% Ss,
	double% S1,
	double% Tl,
	int% SiteClass,
	double% Fa,
	double% Fv
)
abstract GetIBC2006 :
        Name : string *
        DirFlag : int byref *
        Eccen : float byref *
        PeriodFlag : int byref *
        CtType : int byref *
        UserT : float byref *
        UserZ : bool byref *
        TopZ : float byref *
        BottomZ : float byref *
        R : float byref *
        Omega : float byref *
        Cd : float byref *
        I : float byref *
        IBC2006Option : int byref *
        Latitude : float byref *
        Longitude : float byref *
        ZipCode : string byref *
        Ss : float byref *
        S1 : float byref *
        Tl : float byref *
        SiteClass : int byref *
        Fa : float byref *
        Fv : float byref -> int
Parameters
Name
Type: System.String
DirFlag
Type: System.Int32
Eccen
Type: System.Double
PeriodFlag
Type: System.Int32
CtType
Type: System.Int32
UserT
Type: System.Double
UserZ
Type: System.Boolean
TopZ
Type: System.Double
BottomZ
Type: System.Double
R
Type: System.Double
Omega
Type: System.Double
Cd
Type: System.Double
I
Type: System.Double
IBC2006Option
Type: System.Int32
Latitude
Type: System.Double
Longitude
Type: System.Double
ZipCode
Type: System.String
Ss
Type: System.Double
S1
Type: System.Double
Tl
Type: System.Double
SiteClass
Type: System.Int32
Fa
Type: System.Double
Fv
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cAutoSeismic Interface
ETABSv1 Namespace